# 数据储存
# 战舰人员
people = {'MISSION-001':('张三','指挥官'),
          'MISSION-002':('王五','后厨'),
          'MISSION-003':('赵六','载具管理员'),
          'MISSION-004':('孙七',' pilot'),
          'MISSION-005':('李八','武器官'),
          'MISSION-006':('周九','导航员'),
          'MISSION-007':('吴十','工程师'),
          'MISSION-008':('郑十一','医疗官'),
          'MISSION-009':('陈十二','通讯官'),
          'MISSION-010':('林十三','战术分析师')}

# 战舰物资
material =  {'水','食物','氧气'}

daily_consumption = float(10000)
# 物资总量，每个人一天消耗十点物资总量